Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Running plan for project  at dir /home/atlantis/.atlantis/repos/amazondevops/checkov-atls/2/default


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.my_bucket will be created
  + resource "aws_s3_bucket" "my_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "checkov-1-test"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment"       = "dev"
          + "Name"              = "checkov-1-test"
          + "Scope"             = "PCI"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
          + "test"              = "true"
        }
      + tags_all                    = {
          + "Environment"       = "dev"
          + "Name"              = "checkov-1-test"
          + "Scope"             = "PCI"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
          + "test"              = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.my_bucket-test will be created
  + resource "aws_s3_bucket" "my_bucket-test" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "checkov-1-test"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment"       = "dev"
          + "Name"              = "checkov-1-test"
          + "Scope"             = "PCI"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
          + "test"              = "true"
        }
      + tags_all                    = {
          + "Environment"       = "dev"
          + "Name"              = "checkov-1-test"
          + "Scope"             = "PCI"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
          + "test"              = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.test will be created
  + resource "aws_s3_bucket" "test" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-testint-tesr"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment"       = "dev"
          + "Name"              = "Test"
          + "Scope"             = "PCI"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
          + "test"              = "true"
        }
      + tags_all                    = {
          + "Environment"       = "dev"
          + "Name"              = "Test"
          + "Scope"             = "PCI"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
          + "test"              = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.test-1 will be created
  + resource "aws_s3_bucket" "test-1" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-testint-tesrdedbei"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment"       = "dev"
          + "Name"              = "Test"
          + "Scope"             = "PCI"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
          + "test"              = "true"
        }
      + tags_all                    = {
          + "Environment"       = "dev"
          + "Name"              = "Test"
          + "Scope"             = "PCI"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
          + "test"              = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_security_group.example will be created
  + resource "aws_security_group" "example" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic on ports 22, 80, and 3389 from anywhere"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "example-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"              = "Test"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + tags_all               = {
          + "Name"              = "Test"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/amazondevops/checkov-atls/2/default/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/amazondevops/checkov-atls/2/default/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://eedfc93d3ede:4141/lock?id=amazondevops%252Fcheckov-atls%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 5 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`